It works with my setup without any issue (see my outputs below).

Could you please provide me the following information:

* What operating system do you use?
* What Incus version do you use?
* Do you use user-based projects?
* Please run it with `TF_LOG=debug tofu apply` and post your output to the issue.

---

```bash
$ incus version
Client version: 6.11
Server version: 6.11
```

```hcl
terraform {
  required_providers {
    incus = {
      source  = "lxc/incus"
      version = "0.3.1"
    }
  }
}

provider "incus" {
  accept_remote_certificate    = true
  generate_client_certificates = false

  remote {
    name    = "incus-dev"
    scheme  = "https"
    address = "10.0.10.140"
    default = true
  }
}

resource "incus_instance" "pg" {
  project  = "default"
  name     = "pg"
  type     = "container"
  image    = "docker:postgres:15"
  profiles = ["default"]

  lifecycle {
    ignore_changes = [running]
  }

  config = {
    "environment.POSTGRES_USER"     = "postgre"
    "environment.POSTGRES_PASSWORD" = "supersecretpass"
    "environment.POSTGRES_DB"       = "db"
  }
}
```

```bash
$ tofu apply

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

OpenTofu will perform the following actions:

  # incus_instance.pg will be created
  + resource "incus_instance" "pg" {
      + config       = {
          + "environment.POSTGRES_DB"       = "db"
          + "environment.POSTGRES_PASSWORD" = "supersecretpass"
          + "environment.POSTGRES_USER"     = "postgre"
        }
      + ephemeral    = false
      + image        = "docker:postgres:15"
      + ipv4_address = (known after apply)
      + ipv6_address = (known after apply)
      + mac_address  = (known after apply)
      + name         = "pg"
      + profiles     = [
          + "default",
        ]
      + project      = "default"
      + running      = true
      + status       = (known after apply)
      + target       = (known after apply)
      + type         = "container"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

incus_instance.pg: Creating...
incus_instance.pg: Creation complete after 8s [name=pg]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

```bash
$ incus ls
+------+---------+---------------------+------------------------------------------------+-----------------+-----------+
| NAME |  STATE  |        IPV4         |                      IPV6                      |      TYPE       | SNAPSHOTS |
+------+---------+---------------------+------------------------------------------------+-----------------+-----------+
| pg   | RUNNING | 10.25.203.58 (eth0) | fd42:9d4c:1edb:7891:1266:6aff:feec:49a7 (eth0) | CONTAINER (APP) | 0         |
+------+---------+---------------------+------------------------------------------------+-----------------+-----------+
```